       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE.
       AUTHOR. GENADI PETKOV.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION. 

       DATA DIVISION. 
       FILE SECTION. 
       WORKING-STORAGE SECTION. 
       01 WS-STRING             PIC X(64).

       PROCEDURE DIVISION.
           MOVE 'I AM HUNGRY' TO WS-STRING.
           PERFORM REVERSE-STRING.
           DISPLAY WS-STRING.
           STOP RUN.

       REVERSE-STRING.
           MOVE FUNCTION REVERSE (FUNCTION TRIM (WS-STRING)) 
              TO WS-STRING.
